cmsis-svd/cmsis-svd/data/Renesas/R7FA2E2A7.svd
                <register>
                    <name>CGDVST</name>
                    <description>CCC Get Device Status Register</description>
                    <addressOffset>0x364</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PNDINT</name>
                            <description>Pending Interrupt</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRTE</name>
                            <description>Protocol Error</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The Slave has not detected a protocol error since the last Status read.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The Slave has detected a protocol error since the last Status read.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACTMD</name>
                            <description>Slave Device’s current Activity Mode</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Activity Mode 0</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Activity Mode 1</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Activity Mode 2</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Activity Mode 3</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VDRSV</name>
                            <description>Vendor Reserved</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDSPW</name>
                    <description>CCC Max Data Speed W (Write) Register</description>
                    <addressOffset>0x368</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSWDR</name>
                            <description>Maximum Sustained Write Data Rate</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>fscl Max (default value)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>8 MHz</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>6 MHz</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4 MHz</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>2 MHz</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDSPR</name>
                    <description>CCC Max Data Speed R (Read) Register</description>
                    <addressOffset>0x36C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSRDR</name>
                            <description>Maximum Sustained Read Data Rate</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>fscl Max (default value)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>8 MHz</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>6 MHz</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4 MHz</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>2 MHz</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CDTTIM</name>
                            <description>Clock to Data Turnaround Time (TSCO)</description>
                            <lsb>3</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>8 ns or less (default value)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>9 ns or less</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>10 ns or less</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>11 ns or less</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>12 ns or less</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>TSCO is more than 12 ns, and is reported by private agreement.</description>
                                    <value>#111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDSPT</name>
                    <description>CCC Max Data Speed T (Turnaround) Register</description>
                    <addressOffset>0x370</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MRTTIM</name>
                            <description>Maximum Read Turnaround Time</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MRTE</name>
                            <description>Maximum Read Turnaround Time Enable</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables transmission of the Maximum Read Turnaround Time. (GETMXDS Format 1: Without Turnaround) </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables transmission of the Maximum Read Turnaround Time. (GETMXDS Format 2: With Turnaround) </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSM</name>
                    <description>CCC Exchange Timing Support Information M (Mode) Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FREQ</name>
                            <description>Frequency Byte</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>32.0 KHz</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>7.5 MHz</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>15.5 MHz</description>
                                    <value>0x1f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>23.5 MHz</description>
                                    <value>0x2f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>31.5 MHz</description>
                                    <value>0x3f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>39.5 MHz</description>
                                    <value>0x4f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>47.5 MHz</description>
                                    <value>0x5f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>55.5 MHz</description>
                                    <value>0x6f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>63.5 MHz</description>
                                    <value>0x7f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INAC</name>
                            <description>Inaccuracy Byte</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>0.0%</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>1.5%</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>3.1%</description>
                                    <value>0x1f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>4.7%</description>
                                    <value>0x2f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>6.3%</description>
                                    <value>0x3f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>7.9%</description>
                                    <value>0x4f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>9.5%</description>
                                    <value>0x5f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>11.1%</description>
                                    <value>0x6f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>12.7%</description>
                                    <value>0x7f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>14.3%</description>
                                    <value>0x8f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>15.9%</description>
                                    <value>0x9f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>17.5%</description>
                                    <value>0xaf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>19.1%</description>
                                    <value>0xbf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>20.7%</description>
                                    <value>0xcf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>22.3%</description>
                                    <value>0xdf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>23.9%</description>
                                    <value>0xef</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>25.5%</description>
                                    <value>0xff</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BITCNT</name>
                    <description>Bit Count Register</description>
                    <addressOffset>0x380</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BCNT</name>
                            <description>Bit Counter</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
